<?php
/**
 * Created by JetBrains PhpStorm.
 * User: admin
 * Date: 10.05.14
 * Time: 14:07
 * To change this template use File | Settings | File Templates.
 */
include_once('Alchemist.php');
//2 HCl + 2 Na       =        2 NaCl        +        H2
/*
$els = array(
    "H" => "водород",
    "He" => "гелий", "Li" => "литий", "Be" => "бериллий", "B" => "бор", "C" => "углерод", "N" => "азот",
    "O" => "кислород", "F" => "фтор", "Ne" => "неон", "Na" => "натрий", "Mg" => "магний", "Al" => "алюминий",
    "Si" => "кремний", "P" => "фосфор", "S" => "сера", "Cl" => "хлор", "Ar" => "аргон", "K" => "калий", "Ca" => "кальций",
    "Sc" => "скандий", "Ti" => "титан", "V" => "ванадий", "Cr" => "хром", "Mn" => "марганец", "Fe" => "железо",
    "Co" => "кобальт", "Ni" => "никель", "Cu" => "медь", "Zn" => "цинк", "Ga" => "галлий", "Ge" => "германий",
    "As" => "мышьяк", "Se" => "селен", "Br" => "бром", "Kr" => "криптон", "Rb" => "рубидий",
    "Sr" => "стронций", "Y" => "иттрий", "Zr" => "цирконий",
    "Nb" => "ниобий", "Mo" => "молибден", "Tc" => "технеций", "Ru" => "рутений", "Rh" => "родий", "Pd" => "палладий",
    "Ag" => "серебро", "Cd" => "кадмий", "In" => "индий", "Sn" => "олово", "Sb" => "сурьма", "Te" => "теллур", "I" => "иод",
    "Xe" => "ксенон", "Cs" => "цезий", "Ba" => "барий", "La" => "лантан", "Hf" => "гафний", "Ta" => "тантал",
    "W" => "вольфрам", "Re" => "рений", "Os" => "осмий", "Ir" => "иридий", "Pt" => "платина", "Au" => "золото",
    "Hg" => "ртуть", "Ti" => "таллий", "Pb" => "свинец", "Bi" => "висмут", "Po" => "полоний", "At" => "астат",
    "Rn" => "радон", "Fr" => "франций", "Ra" => "радий", "Ac" => "актиний", "Rf" => "резерфордий", "Db" => "дубний",
    "Sg" => "сиборгий", "Bh" => "борий", "hs" => "хассий", "Mt" => "мейтнерий", "Ds" => "дармштадий", "Ce" => "церий",
    "Pr" => "празеодий", "Nd" => "неодим", "Pm" => "прометий", "Sm" => "самарий", "Eu" => "европий", "Gd" => "гадолиний",
    "Tb" => "тербий", "Dy" => "диспрозий", "Ho" => "гольмий", "Er" => "эрбий", "Tm" => "тулий", "Yb" => "иттербий",
    "Lu" => "лютеций", "Th" => "торий", "Pa" => "протактиний", "U" => "уран", "Np" => "нептуний", "Pu" => "плутоний",
    "Am" => "америций", "Cm" => "кюрий", "Bk" => "берклий", "Cf" => "калифорний", "En" => "эйншейний", "Fm" => "фермий",
    "Md" => "менделевий", "No" => "нобелий", "Lr" => "лоуренсий"
);
*/

$acid1 = new Acid();
$acid1->add('H')->add('Cl');

$metal1 = new Metal('Na');
var_dump($metal1->beforeH);

$alchemist = new Alchemist();
if ($alchemist->dissolve($acid1, $metal1)) {
    echo 'successfully' . PHP_EOL;
} else {
    echo 'fail' . PHP_EOL;
}
